// core
import { Fragment } from 'react'
// components
import { Topbar, Main, Footer } from '../components'
// css
import styles from '../static/styles/pages/coin10/index.module.css'
// image
import { Coin10 } from '../static/images'

export default function Coin10page() {
	return (
		<Fragment>
			<Topbar page="เหรียญบาทไทย - เหรียญ 10 บาท"/>
			<Main>
				<section className={`${styles.coin10} container`}>
                    <h1 className={styles.h1}>เหรียญ 10 บาท</h1>
                    <div className={styles.content_1}>
                        <div className={styles.content_title}>
                            <h1 className={styles.h1}>2525</h1>
                        </div>
                        <div className={styles.content_image}>
                            <img src={Coin10.image1} alt="Coin10 Image1" width="100%"/>
                        </div>
                        <div className={styles.content_1_detail}>
                            <h2>เหรียญ 10 บาท สมเด็จพระนางเจ้าสิริกิตติ์ พระบรมราชินีนาถเจริญพระชนมายุ 50 พรรษา</h2>
                            <p>รายละเอียด :</p>
                            <div className={styles.boxDetail}>
                                <p>ด้านหน้า - กลางเหรียญมีพระรูปสมเด็จพระนางเจ้าสิริกิตติ์ พระบรมราชินีนาถผินพระพักตร์เฉียงทางเบื้องซ้าย ชิดวงขอบเหรียญด้านซ้ายมีข้อความว่า "สมเด็จพระนางเจ้าสิริกิตติ์ ด้านขวามีข้อความว่า "พระบรมราชินีนาถ"</p>
                                <p>ด้านหลัง - มีอักษรพระนามาภิไธยย่อ "สก" ไขว้ภายใต้มงกุฎขัตติยราชนารี ด้านซ้ายมีข้อความว่า "ฉลองพระชนมายุ ๕๐ พรรษา ๑๒ สิงหาคม ๒๕๒๕" ด้านขวามีข้อความว่า "50th BIRTHDAY ANNIVERSARY OF H.M. QUEEN SIRIKIT OF THAILAND" มีรูปดอกไม้ประดิษฐ์คั่นข้อความทั้งสองข้าง เบื้องล่างมีข้อความบอกราคาเป็นเลขอารบิคและคำว่า "BATH"</p>
                                <p>เส้นผ่าศูนย์กลลาง 32 มิลลิเมตร</p>
                                <p>น้ำหนัก 15 กรัม</p>
                                <p>วันที่ประกาศใช้ 6 สิงหาคม พ.ศ. 2525</p>
                            </div>
                        </div>
                    </div>
                    <div className={styles.content_2}>
                        <div className={styles.content_title}>
                            <h1 className={styles.h1}>2530</h1>
                        </div>
                        <div className={styles.content_image}>
                            <img src={Coin10.image2} alt="Coin10 Image2" width="100%"/>
                        </div>
                        <div className={styles.content_detail}>
                            <h2>เหรียญ 10 บาท พระราชพิธีมหามงคลเฉลิมพระชนมพรรษา 5 รอบพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช</h2>
                            <p>รายละเอียด :</p>
                            <div className={styles.boxDetail}>
                                <p>ด้านหน้า - กลางเหรียญมีพระบรมรูปพระบาทสมเด็ขพระปรมินทรมหาภูมิพลอดุลยเดชทรงเครื่องบรมขัตติยราชภูษิตาภรณ์ ทรงฉลองพระองค์ครุย ชิดวงขอบเหรียญด้านซ้ายมีข้อความว่า "ภูมิพลอดุลยเดช" ด้านขวามีข้อความว่า "รัชกาลที่ ๙"</p>
                                <p>ด้านหลัง - กลางเหรียญมีพระราชลัญจกรในพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช ด้านล่างมีข้อความบอกราคา ชิดวงขอบเหรียญเบื้องบนมีข้อความว่า "มหามงคลพระชนมพรรษา ๖๐" เบื้องล่างมีข้อความว่า "๕ ธันวาคม ๒๕๓๐ ประเทศไทย" มีลายดอกประจำยามคั่นระหว่างข้อความเบื้องบนกับเบื้องล่าง</p>
                                <p>เส้นผ่าศูนย์กลลาง 32 มิลลิเมตร</p>
                                <p>น้ำหนัก 15 กรัม</p>
                                <p>วันที่ประกาศใช้ 15 สิงหาคม พ.ศ. 2529</p>
                                <img src={Coin10.image3} alt="Coin10 Image3" width="250px" className={styles.detailImage} />
                            </div>
                        </div>
                    </div>
                    <div className={styles.content_3}>
                        <div className={styles.content_title}>
                            <h1 className={styles.h1}>2543</h1>
                        </div>
                        <div className={styles.content_image}>
                            <img src={Coin10.image4} alt="Coin10 Image4" width="100%"/>
                        </div>
                        <div className={styles.content_detail}>
                            <h2>เหรียญ 10 บาท ครบ 50 ปีสำนักงานคณะกรรมการพัฒนาเศรษฐกิจและสังคมแห่งชาติ</h2>
                            <p>รายละเอียด :</p>
                            <div className={styles.boxDetail}>
                                <p>ด้านหน้า - กลางเหรียญมีพระบรมรูปพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชทรงฉลองพระองค์สาลกล ผินพระพักตร์ทางเบื้องขวาภายในวงขอบเหรียญเบื้องบนมีข้อความว่า "พระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช รัชกาลที่ ๙" และ "ประเทศไทย" โดยมีจุดกลมคั่นระหว่างข้อความดังกล่าว</p>
                                <p>ด้านหลัง - กลางเหรียญมีรูปเครื่องหมายราชการของสำนักงานคณะกรรมการพัฒนาเศรษฐกิจและสังคมแห่งชาติ ภายในวงขอบเหรียญเบื้องบนมีข้อควา๑๕ กุมภาพันธ์ ๒๕๔๓" โดยมีจุดกลมคั่นระหว่างข้อความเบื้องบนกับเบื้องล่างทั้งสองข้าง</p>
                                <p>เส้นผ่าศูนย์กลลาง 26 มิลลิเมตร</p>
                                <p>น้ำหนัก 8.5 กรัม</p>
                                <p>วันที่ประกาศใช้ 5 เมษายน พ.ศ. 2543</p>
                                <img src={Coin10.image5} alt="Coin10 Image5" width="250px" className={styles.detailImage} />
                            </div>
                        </div>
                    </div>
                    <div className={styles.content_4}>
                        <div className={styles.content_title}>
                            <h1 className={styles.h1}>2546</h1>
                        </div>
                        <div className={styles.content_image}>
                            <img src={Coin10.image6} alt="Coin10 Image6" width="100%"/>
                        </div>
                        <div className={styles.content_detail}>
                            <h2>เหรียญ 10 บาท 100 ปี กรมจเรทหารบก</h2>
                            <p>รายละเอียด :</p>
                            <div className={styles.boxDetail}>
                                <p>ด้านหน้า - กลางเหรียญมีพระบรมรูปพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชทรงฉลองพระองค์เครื่องแบบเต็มยศจอมพล ทรงสายสะพายนพรัตน์ราชวราภรณ์และสายสร้อยแห่งเครื่องขัตติยราชอิสริยาภรณ์อันมีเกียรติคุณรุ่งเรืองยิ่งมหาจักรีบรมราชวงศ์ผินพระพักตร์ทางเบื้องขวา ภายในวงขอบเหรียญเบื้องบนมีข้อความว่า "พระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชฯ สยามินทราธิราชบรมนาถบพิตร" เบื้องล่างมีข้อความว่า "รัชกาลลที่ ๙" โดยมีเครื่องหมายมหาจักรีบรมราชวงศ์ไขว้คั่นระหว่างข้อความเบื้องบนกับเบื้องล่างทั้งสองข้าง</p>
                                <p>ด้านหลัง - กลางเหรียญมีรูปเครื่องหมายราชการของกรมจเรทหารบกและมีรัศมีเปล่งออกโดยรอบ ภายในวงขอบเหรียญเบื้องบนมีข้อความว่า "๑๐๐ ปี กรมจเรทหารบก ๖ พฤษภาคม ๒๕๔๖ ประเทศไทย" เบื้องล่างมีข้อความ "๑๐ บาท"</p>
                                <p>เส้นผ่าศูนย์กลลาง 26 มิลลิเมตร</p>
                                <p>น้ำหนัก 8.5 กรัม</p>
                                <p>วันที่ประกาศใช้ 6 พฤษภาคม พ.ศ. 2546</p>
                            </div>
                        </div>
                    </div>
                    <div className={styles.content_5}>
                        <div className={styles.content_title}>
                            <h1 className={styles.h1}>2547</h1>
                        </div>
                        <div className={styles.content_image}>
                            <img src={Coin10.image7} alt="Coin10 Image7" width="100%"/>
                        </div>
                        <div className={styles.content_detail}>
                            <h2>เหรียญ 10 บาท 72 ปี สำนักเลขาธิการคณะรัฐมนตรี</h2>
                            <p>รายละเอียด :</p>
                            <div className={styles.boxDetail}>
                                <p>ด้านหน้า - กลางเหรียญมีพระบรมรูปพระปรมินทรมหาภูมิพลอดุลยเดชทรงฉลองพระองค์เครื่องแบบเต็มยศจอมทัพ ทรงเครื่องขัตติยราชอิสริยาภรณ์อันมีเกียรติคุณรุ่งเรืองยิ่งมหาจักรีบรมราชวงศ์และสายสร้อยปฐมจุลจอมเกล้าวิเศษ และมีวงกลมรอบพระบรมรูปเป็นลายเหลี่ยมเพชรภายในวงขอบเหรียญมีข้อความว่า "พระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช"</p>
                                <p>ด้านหลัง - กลางเหรียญมีรูปเครื่องหมายราชการของสำนักเลขาธิการคณะรัฐมนตรีใต้เครื่องหมายราชการมีข้อความว่า "พ.ศ. ๒๕๔๗" ภายในวงขอบเหรียญเบื้องบนมีข้อความว่า "ครบ ๗๒ ปี สำนักเลขธิการคณะรัฐมนตรี" เบื้องล่างมีข้อความว่า "ประเทศไทย" และมีข้อความบอกราคาว่า "๑๐ บาท" ตามลำดับ โดยมีรูปธงชาติคั่นระหว่างข้อความเบื้องบนและเบื้องล่างทั้งสองข้าง</p>
                                <p>เส้นผ่าศูนย์กลลาง 26 มิลลิเมตร</p>
                                <p>น้ำหนัก 8.5 กรัม</p>
                                <p>วันที่ประกาศใช้ 11 มกราคม พ.ศ. 2549</p>
                            </div>
                        </div>
                    </div>
				</section>
			</Main>
			<Footer />
		</Fragment>
	)
}
